{"inkVersion":19,"root":[[{"->":"LookAround"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"LookAround":[["ev","str","^lounge","/str","/ev",{"VAR=":"area","re":true},"ev","str","^none","/str","/ev",{"VAR=":"character","re":true},"^(The Solar System is too damn big for no good reason...)","\n","^(When they told me they had a small, tight-knit community here, I was hoping that meant less travel time.)","\n","^(Where even am I right now? The Asteroid Belt? the Kuiper Belt?)","\n","^(I might as well be in Andromeda, ugh. Some directions would be helpful, but I guess they don't get enough visitors for that.)","\n","^(Think I heard someone around the corner, actually. Maybe they can tell me where I am.)","\n","^...","\n","^(Weird...I don't think I see anyone...)","\n","ev","str","^Mercury","/str","/ev",{"VAR=":"character","re":true},"ev","str","^neutral","/str","/ev",{"VAR=":"pose","re":true},"ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Woah, hey!","\n","^You distracted? Almost bumped in to me!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(Oh, woops. He's so small I almost didn't see him.)","\n","^Sorry, my bad. Yeah, I was totally distracted by something.","\n","^That's what it was...","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Hey, no need to be embarassed, you're not the first. This perfect bod of mine is a shock to everyone!","\n","^Hell, even I'm not immune to its effects. Sometimes I wake up in the morning and I'm just like, wow.","\n","^It's no biggie or anything.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, yeah, right. Anyway, weird running into someone here, wherever \"here\" is.","\n","^But I'm glad I caught you, because I could really use some directions.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Ha! You're at the Asteroid Belt, home of big business and even bigger repair jobs.","\n","^Well, I say \"bigger,\" but not like, too big for me to handle, ya know? Everything's light work when you're this good.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You're still working? I guess I just thought everyone got off around the same time as me.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^No I'm off, buuuuut Jupiter asked me to make some repairs real quick, and I never say no to someone in need!","\n","^I'm all done — hit the gym earlier with Mars too. Now I'm free as a comet.","\n","^I was just gonna chill alone, but then you popped up and I'm obligated to show the newcomer a good time!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You don't have to if you don't want to, I'd be fine just scoping the system out and whatnot.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Nah, c'mon, I gotta!","\n","^You need to know that your new pal Mercury's always gonna be there to support. That's just how it is 'round here.","\n","^So what's the schedule looking like? How does ","ev",{"VAR?":"player_name"},"out","/ev","^ spend their free time?","\n","ev","str","^ Being alone ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ Hanging with friends ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ Trying new things ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^After spending so much energy at work, I just want to relax and unwind by myself most of the time.","\n","^Like I was just wandering around, thinking about stuff, doing things at my own pace. It's nice.","\n","^I know I should be going around getting to know everyone, but I'm just not always in that mood.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"-",{"VAR=":"mercuryAffection","re":true},"/ev","^Oh, uh, I had no idea I was being so annoying...","\n","^Stupid, Mercury, stupid.","\n","^I'll get out of your space if you really don't want me orbiting around you like that.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Wait no, I came to you for directions! It's not you, I promise.","\n","^I don't mind hanging out for a bit, I've already had plenty of alone time.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^If ya say so.","\n",{"->":"SmallTalk"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Normally, I'd just hit up a few friends and just hang out to pass the time, but I can't really do that now.","\n","^I was going around looking for people to talk to so I guess I bumped into you at the perfect time.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I'm definitely all 'bout making new friends! Everyone needs people to support and uplift them, ya know?","\n","^Being alone's the worse, feeling like you're not appreciated and stuff. Sucks.","\n","^But now that I'm here, you got nothing to worry about!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Pretty good to hear, honestly. You have anyone else you'd want to round up for some fun?","\n","^I don't know what there is to do around here; it'd be nice to have a group of friends to show me around.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Uhhhh, not right now. Everyone's super busy all the time.","\n","^I don't really mind, but sometimes it gets kinda lonely.","\n",{"->":"SmallTalk"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I'm in a new system filled with all kinds of new things I want to try! I want to do something I've never done before.","\n","^You don't get opportunities like this that often, so I'm definitely going to make the most out of every cycle.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"+",{"VAR=":"mercuryAffection","re":true},"/ev","^That's what I'm talking about!","\n","^The more experiences under your belt the better! Getting out of your comfort zone helps you grow.","\n","^You already know I'm big on growing — can't get enough of it!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(I, uh, don't think it's working.)","\n","^(I salute your effort, though.)","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Speechless, huh? What can I say? I got a way with words.","\n",{"->":"SmallTalk"},{"#f":5}]}],{"#f":1}],"SmallTalk":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^But yeah, going down the list, there's all kinds of stuff to do — if you want.","\n","^We could drop by the Lounge, but I think you got enough of that for now.","\n","^Uhhhhhhhhhhhh...I guess we're already talking — that's a big thing 'round here.","\n","^Oh! We could check the gym out! I know I said I already went and all, but by the looks of it, you could realllyyyy use it!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(Ouch, but I guess I deserve it.)","\n","^I'll consider it, but I'm feeling pretty beat after my shift...","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Ahem, I, Mercury, humbly extend you a once-in-a-lifetime offer to join the Buff Boys Club.","\n","^Right now, it's me, Mars, aaaannndddddd that's it. And maybe you! Not everyone's serious about their health, I guess.","\n","^We meet most cycles to pump iron and hype each other up, 'cause that's what real homies do. You could be a homie too!","\n","^What do ya say? You in?","\n","ev","str","^ I'm totally in ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ Absolutely not ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ Let me think about it ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^For sure, I'm totally in!","\n","^I came all the way here to turn my life around, so why stop now. What time do you meet?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"+",{"VAR=":"mercuryAffection","re":true},"/ev","^Wow, cool! No one's ever actually agreed before, I don't really know what to do. But you can definitely join!","\n","^Of course, I'm gonna hafta talk this over with Mars. You gotta understand, we take our applications real seriously.","\n","^But I'm sure that determination of yours'll win the club over!","\n",{"->":"MoreTalk"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I don't know, I have a lot on my plate right now as it is, sooo no. Absolutely not.","\n","^Don't worry about me, I do enough to keep myself healthy.","\n","^Keep going your thing though, I'm know the Buff Boys Club will thrive without me.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"-",{"VAR=":"mercuryAffection","re":true},"/ev","^Awww, guess I can't force you to join.","\n","^I was looking forward to working out with someone new for once, but it's whatever. Me and Mars are doing good already.","\n","^If you ever change your mind, we'd love to have ya! Unless it's 'cause we're not cool enough for you...","\n",{"->":"MoreTalk"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Let me have some time to think about, it's been busy, busy, busy for me with the Lounge and my new place.","\n","^I want to start going to the gym, I really do, but now's not the best time.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I guess later is better than never...","\n","^No problem, just give me or Mars a call when you're ready to level up your physique!","\n","^Taking that first step is super important so the quicker you take it, the better.","\n","^Also, it means we can get to hanging out more often! That'll be funnnn.","\n",{"->":"MoreTalk"},{"#f":5}]}],{"#f":1}],"MoreTalk":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^There's all kinds of benefits that come with the Buff Boy lifestyle.","\n","^For starters, everyone's gotta find a way to form good habits, and hitting the gym with the homies is the best way to start.","\n","^Before you know it, you'll have yourself a healthy routine that goes beyond just lifting weights, with benefits beyond just a nice body.","\n","^You'll be moving better, working faster, playing harder — your whole life changes and all it takes is some time every cycle with your new best friends.","\n","^Actually, I read this really cool book that—","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Okay, okay, I got it, don't worry.","\n","^Sounds awesome and all, but, like I said, not right now.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^What if I flex for you a little, would that change anything? Once you see what's possible with just a little bit of—","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No! I'm good — we're good. I will think about what you've said.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, alright, super.","\n","^Still gonna flex a bit, though.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^It's fine—","\n","^(He's really doing it. Really straining himself, huh?)","\n","^(Oh? Oooo. Well, I guess he is making some...pretty good arguments there.)","\n","^(Uh...)","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Anyway, It's all cool. I don't really plan on hopping back into the gym this cycle.","\n","^It's not that I'm, like, tired or anything, but, ya know, can't overdo it. Sometimes I gotta remind myself that I'm still only a planet.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I mean, well, thanks for all the help, and all that other stuff.","\n","^I didn't really mean to bother you for that long, so if you're tired then we can end it here. You already helped me a lot, so don't worry.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Not tired, I'm not tired.","\n","^Okay, maybe I'm a teensy weensy bit tired, if you can even call it that. I wouldn't, but I can see how it might look like that.","\n","^Sometimes it sneaks up on ya, but there's no way that's happening any time soon. I still got a lotta energy, especially to entertain a buddy.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No really, we've talked plenty. We should both get some rest after a long cycle at work.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Naaahhhhh, I'm saying it's all good.","\n","^So...um...how's theeeee Solar System been treating ya?","\n","ev","str","^ It's the best ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ I don't know yet ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ Nothing different ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^What can I say? It's the best. Nothing like what I'm used to back in my old system.","\n","^I'm working towards this sweet job serving drinks to really nice customers, who also happen to be my neighbours. What do I really have to complain about?","\n","^And it's only getting better from here. I'm learning all this stuff about the system and where I fit into it.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"+",{"VAR=":"mercuryAffection","re":true},"/ev","^Yeah that's great to hear. Was worried you weren't feeling it here...","\n","^This is an awesome system to live in, no doubt. Especially when you got planets like me showing you the ropes.","\n","^I got so much more to show you and talk to you about, but we should save that for...some other time.","\n","^Can't be having too much excitement in one cycle...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^True, this cycle's been pretty hectic for me. The next few are probably going to be a little rough, but I'm still hyped.","\n",{"->":"PostSecret"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I think I'll have a better answer for you after a few more cycles. I'm still feeling everything out.","\n","^The potential of a new job, a new community, new...everything? It's going to take a bit to digest how I'm feeling.","\n","^No bad vibes, though. You've all been great so far.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Me being great isn't changing any time soon, count on that!","\n","^Don't let things like that trouble you too much...you're gonna see how awesome things are in this system.","\n","^And if something kinda bothers you, just lemme know and I'll do whateverrrr it takes to make you feel at home.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Aw, thanks! It really means a lot to know I have people I can talk to out here.","\n",{"->":"PostSecret"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Eh, it's honestly nothing different. This system, my last one, it's all the same. I guess they're all kind of the same.","\n","^There's a star, some planets, some comets, some asteroids, and a whole bunch of nothing. I don't know what I expected, honestly.","\n","^The new career path is different, but that's about it I'd say.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"-",{"VAR=":"mercuryAffection","re":true},"/ev","^Just some planet, huh? So I really did leave a bad impression on you...","\n","^I-I know you'll warm up to us eventually, I just...know it.","\n","^I really hope so...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I didn't mean I found you to be boring! I was talking about just how things work around here.","\n","^There's cool folks everywhere, and I know you're one of them.","\n","^It's just that things are just the same no matter where you go. My expectations were just too high.","\n",{"->":"PostSecret"},{"#f":5}]}],{"#f":1}],"PostSecret":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^It's a cool place, ya know? Everyone's gotta do their part and be kind to one another or everything falls apart.","\n","^Sometimes...people forget about that last part. Or at least I think they do.","\n","^I don't know...sometimes I just feel like everyone's mad at me...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^What could they be mad about? You're super kind and really helpful!","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh? Yeah, you're right. I am!","\n","^I'm kind, helpful, and insanely good-looking, just like you said!","\n","^Still...it always feels like you can do more. I want everyone to be happy...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I feel that, all we can do is try our best.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, I am. And part of being a good friend is giving your friend some space...soooo...","\n","^Jeez, I'm really beat...ugh...this cycle...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(He admitted it? He must be extra tuckered out.)","\n","ev","str","^ Let's talk a little longer ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ Let's do whatever you want ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ Let him rest ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^We should both probably get going, but I want to talk just a little longer.","\n","^I'm really curious about all the stuff the system hasn't shown me yet.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"-",{"VAR=":"mercuryAffection","re":true},"/ev","^Oh? Uh? Yeah...soooo...","\n","^There's a lot of...","\n","^I'm sorry, I actually have some other, uh, duties to take care of. I'll make it up to you, promise.","\n","^Work, to the gym, to the Jupiter stuff...just a busy day, ya know?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No worries there. I don't want to keep you from living your life.","\n","^We'll definitely continue where we left off next time.","\n",{"->":"Goodbye"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^We can do whatever you want; you're the captain and I'm the inexperienced newbie after all.","\n","^I know you have plenty of neat things in mind, right?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^If it's up to me...then...","\n","^How about we try out this new game, yeah! Basically, we both head out and reconvene later to talk more...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You mean like, calling it here and going home?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Uhhh...I mean if you say so. Actually, that's what we should totally do.","\n","^Ugh, sorry...I'm actually kinda out of it right now. Between work and all the extra stuff I was doing for Jupiter...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh no I totally get it. It's no big deal — we'll talk more next time.","\n",{"->":"Goodbye"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You know what? I think I'm going to head out now. I have some other stuff I need to take care of before the cycle ends.","\n","^I'm sure you have lots of important things to handle on your end as well, so I shouldn't be keeping you from them.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"mercuryAffection"},1,"+",{"VAR=":"mercuryAffection","re":true},"/ev","^Oh, yeah? Yeah! Totally, you're right.","\n","^I got lots of stuff to take care of just like you said.","\n","^I could go for waaaaaaay longer, obviously, but we are busy folks here in the Solar System, so...","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No problem here. Rest up, Mercury.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Thanks, ","ev",{"VAR?":"player_name"},"out","/ev","^.","\n",{"->":"Goodbye"},{"#f":5}]}],{"#f":1}],"Goodbye":["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^See ya...sorry again.","\n","end",{"#f":1}],"changeName":[{"temp=":"newName"},"ev",{"VAR?":"newName"},"/ev",{"VAR=":"player_name","re":true},{"#f":1}],"changeCharacter":["ev",{"VAR?":"character"},"/ev","~ret",{"#f":1}],"getCharacterVisible":["ev",{"VAR?":"characterVisibility"},"/ev","~ret",{"#f":1}],"getArea":["ev",{"VAR?":"area"},"/ev","~ret",{"#f":1}],"getAffection":["ev",{"VAR?":"mercuryAffection"},"/ev","~ret",{"#f":1}],"global decl":["ev","str","^protag","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"character"},0,{"VAR=":"characterVisibility"},"str","^","/str",{"VAR=":"pose"},"str","^","/str",{"VAR=":"background"},"str","^","/str",{"VAR=":"area"},0,{"VAR=":"mercuryAffection"},0,{"VAR=":"bartendingPoints"},"/ev","end",null],"#f":1}],"listDefs":{}}