{"inkVersion":19,"root":[[{"->":"LookAround"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"LookAround":[["ev","str","^lounge","/str","/ev",{"VAR=":"area","re":true},"ev","str","^none","/str","/ev",{"VAR=":"character","re":true},"^(Now that I can officially step away from the bar and enjoy some free time...well. Honestly, I'm not sure what to do.)","\n","^(I'm still new here, it's not like I know the folks around here well enough to just insert myself into their conversations.)","\n","^(I look around the room for something to distract myself with so that I don't look too awkward just standing around, when I spot Venus.)","\n","^(They're kinda hard to miss. They're standing across the room, taking selfies with their drink.)","\n","^(They notice me looking and break into a grin, waving me over. I guess I'll be spending my free time with them.)","\n","^(They barely wait until I'm within earshot to start talking.)","\n","ev","str","^Venus","/str","/ev",{"VAR=":"character","re":true},"ev","str","^neutral","/str","/ev",{"VAR=":"pose","re":true},"ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh my stars, hey babe! Perfect timing. Can you take a quick pic for me? K, thanks, you're an absolute icon.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(It doesn't seem like I actually have much of a choice. I take their phone as they strike a pose, snapping a couple of pictures for them.)","\n","^(They snatch their phone back once they figure I've taken enough and look through the pictures.)","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, cute! I love these. Thanks a ton, hun.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(They fiddle with their phone for a bit before looking back at me.)","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^What do you think I should caption this?","\n","ev","str","^ Make them stop and stare ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ Trouble never looked so fine ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ You don't have to like me. Can't force you to have good taste ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I think something like \"Make them stop and stare\" might be cool?","\n","^It suits you. I know I can't help but stare for a bit whenever I see you. You really demand attention.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"+",{"VAR=":"venusAffection","re":true},"/ev","^Awww! You are just so cute, sugar! I'm flattered.","\n","^Plus, that caption would be totally perfect.","\n","^Maybe add, like, that nail painting emoji and a sparkle emoji after it, too.","\n","^Ugh, I love it, so gonna use that one.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(They immediately start fiddling with their phone again. After a minute, they slip it back into their pocket.)","\n",{"->":"SmallTalk"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^A caption like \"Trouble never looked so fine\" could work?","\n","^Maybe with a sunglasses emoji, too.","\n","^You just seem, like, an absolute bad bitch, right? So maybe play on that?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh my god, stoooop.","\n","^I mean, yeah, I'm for sure the baddest bitch, and I know that, but I've got an image to maintain, you know?","\n","^I can't exactly go branding myself as being \"trouble\".","\n","^Besides, the sunglasses emoji? That's so tacky.","\n","^It's not terrible, though...I can workshop it a bit.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^(They type away on their phone for a minute before putting it away.)","\n",{"->":"SmallTalk"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You should definitely try something about being true to you.","\n","^Like... \"You don't have to like me. Can't force you to have good taste.\"","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"-",{"VAR=":"venusAffection","re":true},"/ev","^Oh...honey.","\n","^I mean, don't get me wrong, I'm all about being me.","\n","^But doesn't that come across as kinda snobby? I don't want people to think I think I'm better than them.","\n","^I'm just like anyone else, just with more money, fame, and a way better sense of style.","\n","^You tried your best, I guess...I'll figure something else out later.","\n","^(They put their phone away.)","\n",{"->":"SmallTalk"},{"#f":5}]}],{"#f":1}],"SmallTalk":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^So! Enough of that for now. What are you up to? I thought you were supposed to be behind the bar?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, I'm just taking a little break right now. Sol said it's fine to walk around for a bit.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Aww, and you're choosing to spend your free time with me? I'm flattered...but not surprised. I'd spend my time with me, too.","\n","^On a serious note, I know I called you over here, but if you'd rather go do something else, you can.","\n","^Don't worry! I won't be offended. I know I can be a lot to  take in all at once.","\n","^I wouldn't be surprised if you were too intimidated by my glory to stick around for too long.","\n","ev","str","^ You ARE intimidating ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ I like being around you ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ I don't have anything better to do ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I mean...if I'm being honest, you are kind of intimidating.","\n","^You really have a lot to say and don't seem like you hold back anything, ever.","\n","^It's not necessarily a bad thing, just...like you said, it's a lot to take in all at once.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Haha, I get that all the time, trust me.","\n","^It's just kinda how I've always been. Sorry, not sorry, lmao.","\n",{"->":"MoreTalk"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^What? No way. I like hanging out with you.","\n","^I mean, granted, I haven't known you for very long, but I appreciate how open and honest you are.","\n","^I never have to wonder what you're thinking or worry about if I said something you didn't like, because I know you'll tell me.","\n","^Not to mention, I think your whole glamorous, larger than life attitude is just really cool and charming.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"+",{"VAR=":"venusAffection","re":true},"/ev","^Awww, oh my stars, baaaabeeee...!","\n","^Quit it, you're gonna make me blush! You're so sweet.","\n","^I bet you're just trying to butter me up, huh?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No way!","\n","^I really mean it, Venus.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, you are just too precious, hun.","\n","^Am I dreaming? Quick, pinch me and let's see if this cutie in front of me disappears.","\n",{"->":"MoreTalk"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I guess I can stick around for a while.","\n","^It's not like I have anything better to do. Everyone else seems busy.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"-",{"VAR=":"venusAffection","re":true},"/ev","^Ouch. Be a little more blunt, would you?","\n","^I'm offering to hang out, if you want, but since you'd clearly rather be somewhere else, you can just go.","\n","^I don't deserve to be anyone's back up choice.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Sorry? I wasn't trying to be rude. I was just being honest, like you.","\n","^You're pretty blunt yourself, you know. You never hold anything back.","\n",{"->":"MoreTalk"},{"#f":5}]}],{"#f":1}],"MoreTalk":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Tbh, I used to be pretty self conscious about how, like...\"loud and proud\" I am, I guess.","\n","^People literally point that out to me all the time.","\n","^But that's just me. And it's not something I can change, so, you know.","\n","^Besides, the internet loves it!","\n","^Oops, I'm totally rambling, huh? Super embarrassing, lol.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I get why that's embarrassing, but I'm glad that you shared that with me.","\n","^It makes me feel like I know you a little better.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I do love talking about me, so I'm sure you'll get to know a lot about me over time!","\n","^But I wanna get to know you too, sweetie! Tell me something about yourself. Anything! I promise I can keep a secret, believe it or not.","\n","ev","str","^ Bartending is my dream job ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ If I had enough money to afford it, I'd never work again ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ When I'm not here I just wear the same sweatpants every cycle","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^This might be kind of lame, but bartending is actually my dream job.","\n","^I know it's not a conventional, respectable job like a doctor, or something glamorous and attention grabbing, like your job.","\n","^But mixing all sorts of different drinks is really cool to me.","\n","^And even better, I love getting to meet and talk to all sorts of new, different people.","\n","^Like, if I wasn't here, where else would I have met someone like you?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"+",{"VAR=":"venusAffection","re":true},"/ev","^Oh, honey, there is no one else like me out there.","\n","^I'm so glad that you have a dream that you're passionate about, and that you're actively pursuing it!","\n","^I think it's like, super important to do what you love.","\n","^Even if it's a gamble sometimes, it's better to at least try to live your fantasy and fail, than to be too scared to even attempt it and risk totally losing any chance you have.","\n","^Maybe that's a little obvious, though, given what I do, haha!","\n","^Really, though, babe, good for you. I'm proud of you for going for this!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You're...proud of me?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I really am. Is that weird?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^No, no...!","\n","^It's actually...really nice.","\n","^Thank you.","\n",{"->":"PostSecret"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Well, if I'm being totally honest, I don't love the grind of working to make ends meet.","\n","^If I had the option to just live my normal life and not work while someone just paid my expenses for me, I'd take it.","\n","^I'd never do any kind of work again. I'd just...hang out.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh...really?","\n","^Wouldn't it be better to use those finances as a safety blanket so you can safely risk chasing your dreams?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^My dreams involve staying in bed all cycle and playing video games.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh.","\n","^I mean, I totally get not liking the grind of, like, some normie job like yours - no offense.","\n","^Even I don't always feel like dolling myself up and posting cute pics for my adoring fans, if you can believe that.","\n","^Sometimes it's nice to just take a break and relax, focus on yourself and all.","\n","^But I don't think I could live like that every cycle, you know?","\n","^I think It's like, super important to have ambition, drive, and passion, don't you?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^But all that is so much work.","\n","^I just want to sleep.","\n",{"->":"PostSecret"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Well...when I'm not working and I can just stay home, I just wear the same sweatpants every cycle.","\n","^I really only take them off to wash them, or to shower.","\n","^They've got a few holes in them at this point, and more than a few stains.","\n","^But they're just so warm and comfy, I can't stand the thought of wearing anything else if I don't absolutely have to.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"-",{"VAR=":"venusAffection","re":true},"/ev","^Oh my stars...please tell me you're joking.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Nope. You wanted to know something about me, so...there's the truth.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh my stars...gag me.","\n","^Sweetie, that's gross.","\n","^Like, I can respect a cute, casual fit sometimes, but the same sweats every cycle? That's kinda nasty. And not good nasty, either, if that wasn't clear.","\n","^It's mondo important to take care of yourself and be put together and stuff.","\n","^Dressing like that absolutely won't cut it.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh. Sorry, I guess?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^No, I mean...I guess I'm the one who asked?","\n","^Just...try and be better to yourself than that. You have the potential to slay, just put a little work in.","\n",{"->":"PostSecret"},{"#f":5}]}],{"#f":1}],"PostSecret":[["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Either way, thanks for telling me that about yourself.","\n","^Now we both know a little more about each other, yeah?","\n","^I love getting to know you normal people a bit better, makes you feel more real, almost like we could be equals in some ways, you know?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Uh...I don't know if I'd put it that way, but sure.","\n","^It's been cool getting to know more about you, too.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Haha, I know!","\n","^But really, I'm a total open book, babe.","\n","^Thanks for being open with me too!","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Yeah, of course.","\n","^It's part of my job to build that connection with customers so I can cater to them better, after all.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh my stars, I totally never thought of it like that...!","\n","^If you put it that way, our jobs are kinda similar, huh?","\n","^After all, I have to connect with my fans if I want them to like me and keep coming back for more.","\n","ev","str","^ Seems like hard work ","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^ I don't think it's that similar ","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^ You're pretty likable ","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Seems like it's pretty hard work, trying to make people like you all the time.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Aww, what, you think I have to try that hard?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh, no, that's not what I meant! I just-","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Ahaha, relax, babe! I was totally just messing you.","\n","^You're so totes adorbs when you get all flustered and worked up like that, ","ev",{"VAR?":"player_name"},"out","/ev","^!","\n","^It totally is hard work.","\n","^Like, keeping up with all these different social medias, managing my image 24/7, reaching out to fans to make sure they feel heard and appreciated - it can be a lot.","\n","^But in the end, it's still totally worth it.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^You seem like you really love what you do.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I so do!","\n","^I wouldn't rather do anything else.","\n",{"->":"Goodbye"},{"#f":5}],"c-1":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^I don't know...I don't think our jobs are that similar.","\n","^I mean, I have to clean the bar and have all this knowledge of different drinks and how to make them.","\n","^You just have to look good and take a few pictures every now and then.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"-",{"VAR=":"venusAffection","re":true},"/ev","^Excuse me?","\n","^There's way more that goes into it than that!","\n","^That would be like me saying all you have to do is pour a couple of liquids into a glass.","\n","^Doesn't feel very good to be judged or have your work underappreciated, does it?","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^...No. It doesn't.","\n","^I guess I was being kind of insensitive.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Um, try super insensitive???","\n","^I love my job, and believe it or not, it's not easy, so I really don't appreciate you belittling me for it.","\n","^You should never talk down to someone for what they do. You don't know what it's like.","\n","^Being in the public eye constantly isn't always as fun and glamorous as it seems, you know?","\n","^Think before you speak next time.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Yeah...you're right. That was rude of me.","\n",{"->":"Goodbye"},{"#f":5}],"c-2":["\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Seems like the perfect job for you, then.","\n","^I mean, who wouldn't like you and want to be connected to you in some way?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"ev",{"VAR?":"venusAffection"},1,"+",{"VAR=":"venusAffection","re":true},"/ev","^Oh my stars, you are just the sweetest thing ever...!","\n","^You're totally right, though.","\n","^My fans totally adore me.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^Of course they do. I mean, look at you!","\n","^Not to mention how sincere and open you are.","\n","^You're just the type of person I think everyone would want to be like, or want attention from.","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Stop, you're gonna get me all flustered!","\n","^What a doll, really, you're a total babe.","\n","^Do you talk to everyone that way, or am I just special?","\n","^Actually, don't answer that. Obviously I'm special. I'm Venus, after all.","\n","ev",0,"/ev",{"VAR=":"characterVisibility","re":true},"^How could I forget to mention how admirable your confidence is?","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^Oh my stars, I'm blushing.","\n","^You're so adorable, I can't even.","\n",{"->":"Goodbye"},{"#f":5}]}],{"#f":1}],"Goodbye":["ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I'd totes love to stay and chat, but it's getting late, and my fans are expecting a cute goodnight selfie from me.","\n","^I should probably get going.","\n","ev",{"VAR?":"venusAffection"},3,">","/ev",[{"->":".^.b","c":true},{"b":["\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^You should come say hi again next time I come by!","\n","^It's actually, like, super nice to talk to you!","\n",{"->":".^.^.^.14"},null]}],"nop","\n","ev",1,"/ev",{"VAR=":"characterVisibility","re":true},"^I'm heading out now.","\n","^Later, babe!","\n","^Tell Sol bye for me!","\n","end",{"#f":1}],"changeName":[{"temp=":"newName"},"ev",{"VAR?":"newName"},"/ev",{"VAR=":"player_name","re":true},{"#f":1}],"changeCharacter":["ev",{"VAR?":"character"},"/ev","~ret",{"#f":1}],"getCharacterVisible":["ev",{"VAR?":"characterVisibility"},"/ev","~ret",{"#f":1}],"getSolAffection":["ev",{"VAR?":"solAffection"},"/ev","~ret",{"#f":1}],"getMercuryAffection":["ev",{"VAR?":"mercuryAffection"},"/ev","~ret",{"#f":1}],"getVenusAffection":["ev",{"VAR?":"venusAffection"},"/ev","~ret",{"#f":1}],"getEarthAffection":["ev",{"VAR?":"earthAffection"},"/ev","~ret",{"#f":1}],"getBartendingPoints":["ev",{"VAR?":"bartendingPoints"},"/ev","~ret",{"#f":1}],"getArea":["ev",{"VAR?":"area"},"/ev","~ret",{"#f":1}],"getIdealIngredient1":["ev",{"VAR?":"idealIngredient1"},"/ev","~ret",{"#f":1}],"getIdealIngredient2":["ev",{"VAR?":"idealIngredient2"},"/ev","~ret",{"#f":1}],"getIdealIngredient3":["ev",{"VAR?":"idealIngredient3"},"/ev","~ret",{"#f":1}],"getMinimalIngredients":["ev",{"VAR?":"minimalIngredients"},"/ev","~ret",{"#f":1}],"setSolAffection":[{"temp=":"amount"},"ev",{"VAR?":"amount"},"/ev",{"VAR=":"solAffection","re":true},{"#f":1}],"setMercuryAffection":[{"temp=":"amount"},"ev",{"VAR?":"amount"},"/ev",{"VAR=":"mercuryAffection","re":true},{"#f":1}],"setVenusAffection":[{"temp=":"amount"},"ev",{"VAR?":"amount"},"/ev",{"VAR=":"venusAffection","re":true},{"#f":1}],"setEarthAffection":[{"temp=":"amount"},"ev",{"VAR?":"amount"},"/ev",{"VAR=":"earthAffection","re":true},{"#f":1}],"setBartendingPoints":[{"temp=":"amount"},"ev",{"VAR?":"amount"},"/ev",{"VAR=":"bartendingPoints","re":true},{"#f":1}],"global decl":["ev","str","^protag","/str",{"VAR=":"player_name"},"str","^","/str",{"VAR=":"character"},0,{"VAR=":"characterVisibility"},"str","^","/str",{"VAR=":"pose"},"str","^","/str",{"VAR=":"background"},"str","^","/str",{"VAR=":"area"},0,{"VAR=":"solAffection"},0,{"VAR=":"mercuryAffection"},0,{"VAR=":"venusAffection"},0,{"VAR=":"earthAffection"},0,{"VAR=":"bartendingPoints"},0,{"VAR=":"idealIngredient1"},0,{"VAR=":"idealIngredient2"},0,{"VAR=":"idealIngredient3"},0,{"VAR=":"minimalIngredients"},"/ev","end",null],"#f":1}],"listDefs":{}}